In [2]:
# pi3 install jupyter
# pip3 install numpy 
# pip3 install pandas
# 启动 jupyter 
# 在工作目录下启动 jupyte notebook

# numpy 数学库，用于数组计算（一维、二维、多维），对list进行部分封装，提供了非常便利的科学运算功能，因此在数值计算，机器学习，人工智能，神经网络等领域广泛应用。
# Numpy的核心是ndarray，ndarray本质是数组
# 官网：https://numpy.org/doc/stable/reference/

# pandas 侧重于数据处理，清洗
# pandas用户指南，https://pandas.pydata.org/docs/user_guide/index.html
# Shift + 回车  //执行
# all + 回车

import numpy as np
import pandas as pd

In [3]:
# a = np.array()   # 报错，选中 array() 按 shift + tab ,显示函数array参数信息，便于定位或修改。
a = np.array([1,2,3,4])
print(a)
print(type(a))  # <class 'numpy.ndarray'>

[1 2 3 4]
<class 'numpy.ndarray'>

In [4]:
b= np.array([[1,2],[3,4],[5,6]])
print(b)

[[1 2]
 [3 4]
 [5 6]]

In [5]:
b = np.array([[[1,2],[3,4],[5,6]]])
b.ndim  # 查看数据维度

3

In [6]:
b.dtype

dtype('int32')

In [7]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [8]:
# linspace是等差数列，默认num=50
# [0,2]区间里，共11个元素，公差个d=0.2
np.linspace(0,2,num=11)

array([0. , 0.2, 0.4, 0.6, 0.8, 1. , 1.2, 1.4, 1.6, 1.8, 2. ])

In [9]:
np.linspace(1,10)

array([ 1.        ,  1.18367347,  1.36734694,  1.55102041,  1.73469388,
        1.91836735,  2.10204082,  2.28571429,  2.46938776,  2.65306122,
        2.83673469,  3.02040816,  3.20408163,  3.3877551 ,  3.57142857,
        3.75510204,  3.93877551,  4.12244898,  4.30612245,  4.48979592,
        4.67346939,  4.85714286,  5.04081633,  5.2244898 ,  5.40816327,
        5.59183673,  5.7755102 ,  5.95918367,  6.14285714,  6.32653061,
        6.51020408,  6.69387755,  6.87755102,  7.06122449,  7.24489796,
        7.42857143,  7.6122449 ,  7.79591837,  7.97959184,  8.16326531,
        8.34693878,  8.53061224,  8.71428571,  8.89795918,  9.08163265,
        9.26530612,  9.44897959,  9.63265306,  9.81632653, 10.        ])

In [10]:
np.random.randn(6,4)

array([[-0.0339566 , -0.82825695, -0.88260698, -1.20525783],
       [-0.03282781, -0.9699322 ,  0.36353083, -1.33621932],
       [-0.58606822,  0.85989059, -0.05315141,  1.18849822],
       [-1.19196634,  0.9552477 , -0.4830388 ,  0.86178121],
       [ 2.30660023, -0.42902709,  0.30936429,  1.33119226],
       [-0.58104033, -2.87670704, -0.18715678,  2.41271319]])

In [11]:
# 随机生成4行2列的二维数组
np.random.rand(4,2)

array([[0.23720929, 0.43435629],
       [0.03711502, 0.54512836],
       [0.77283759, 0.8391236 ],
       [0.71665289, 0.37766008]])

In [12]:
# 随机生成4个3行2列的三维数组
np.random.rand(3,4,2)

array([[[0.40049623, 0.1130087 ],
        [0.63514869, 0.14747508],
        [0.95081396, 0.21376674],
        [0.65112236, 0.47766499]],

       [[0.84111721, 0.03334411],
        [0.02691873, 0.52750782],
        [0.024029  , 0.86165636],
        [0.90264704, 0.11607064]],

       [[0.7560993 , 0.05426105],
        [0.15723877, 0.18893299],
        [0.3204492 , 0.05960422],
        [0.35020474, 0.64931601]]])

In [13]:
# 随机生成[0,1)之间的整数，所以只有0
np.random.randint(1,size=5)

array([0, 0, 0, 0, 0])

In [14]:
# 随机生成[1,5)之间的整数
np.random.randint(1,5)

2

In [15]:
# 随机生成[-5,5)之间的二维数组
np.random.randint(-5,5,size=(3,2))

array([[ 4,  2],
       [ 4,  0],
       [-5, -5]])

In [16]:
# 随机生成[1,2)之间的整数，所以只有1
np.random.randint(1,2,size=5)

array([1, 1, 1, 1, 1])

In [17]:
# np.random.seed()的作用：使得随机数据可预测。当我们设置相同的seed，每次生成的随机数相同。
np.random.seed(0)
print(np.random.rand(5))

[0.5488135  0.71518937 0.60276338 0.54488318 0.4236548 ]

In [18]:
np.random.seed(10)
print(np.random.rand(5))

[0.77132064 0.02075195 0.63364823 0.74880388 0.49850701]

In [19]:
np.random.seed(10)
print(np.random.rand(5))

[0.77132064 0.02075195 0.63364823 0.74880388 0.49850701]

In [20]:
### pandas 简介
# - 是一个专注于数据处理的一个库
# - 可以帮助数据分析、数据挖掘、算法工程师的人员其高耸的姐姐数据预处理的问题
# Pandas模块的数据结构主要有两种：1.Series 2.DataFrame
###

In [21]:
# Series 是一维数组，基于Numpy的ndarray 结构
# Series([data, index, dtype, name, copy, …])	
# np.nan是一个float类型的数据，得到结果显示NaN，可进行计算，如np.sum(),此时NaNcy默认是0.0
obj = pd.Series([1,2,3,4,5,np.nan])
obj

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [22]:
np.sum(obj)

15.0

In [23]:
obj = pd.Series([1,2,3,4,5])
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
obj[0]

1

In [25]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
# 通过索引号获取元素，这里2个中括号中的是索引号
obj[[0,2,4]]

0    1
2    3
4    5
dtype: int64

In [27]:
# pd.Series({dict}) 结果 key=index
d = {'a':10,'b':20,'c':30,'d':40,'e':50}
d = pd.Series(d)
d

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [28]:
d.values

array([10, 20, 30, 40, 50], dtype=int64)

In [29]:
# 通过key获取值
d["a"]

10

In [30]:
# 通过索引号获取值
d[2]

30

In [31]:
# 显示列表的索引号与类型
d.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [32]:
i = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Jeff', 'Ryan'] 
a = pd.Series([4, 7, -5, 3, 7, np.nan],index = i)
a

Bob      4.0
Steve    7.0
Jeff    -5.0
Ryan     3.0
Jeff     7.0
Ryan     NaN
dtype: float64

In [33]:
# value_counts()是一种查看表格某列中有多少个不同值的快捷方法，并计算每个不同值有在该列中有多少重复值
a.value_counts()

 7.0    2
-5.0    1
 4.0    1
 3.0    1
dtype: int64

In [34]:
# 将原来的值变成了索引号
a1 = a.value_counts()
a1[-5.0]

1

In [35]:
a1.index

Float64Index([7.0, -5.0, 4.0, 3.0], dtype='float64')

In [36]:
# 数据集依照某个字段中的数据进行排序
a.sort_values()

Jeff    -5.0
Ryan     3.0
Bob      4.0
Steve    7.0
Jeff     7.0
Ryan     NaN
dtype: float64

In [37]:
a.sort_values(ascending=False)

Steve    7.0
Jeff     7.0
Bob      4.0
Ryan     3.0
Jeff    -5.0
Ryan     NaN
dtype: float64

In [38]:
a.rank(method='first')

Bob      3.0
Steve    4.0
Jeff     1.0
Ryan     2.0
Jeff     5.0
Ryan     NaN
dtype: float64

In [39]:
# 函数dtype()数据类型
# NumPy 数字类型是dtype(数据类型)对象的实例，每个对象具有唯一的特征。 这些类型可以是np.bool_，np.float32等。
# 语法：numpy.dtype(object, align, copy)
# 每个内建类型都有一个唯一定义它的字符代码：
# ‘b’：布尔值
# ‘i’：符号整数
# ‘u’：无符号整数
# ‘f’：浮点
# ‘c’：复数浮点
# ‘m’：时间间隔
# ‘M’：日期时间
# ‘O’：Python 对象
# ‘S’, ‘a’：字节串
# ‘U’：Unicode
# ‘V’：原始数据(void)

# 使用数组标量类型
np.dtype(np.int32)  # #int8，int16，int32，int64 可替换为等价的字符串 'i1'，'i2'，'i4'，以及其他。
# np.dtype("i4")  # dtype('int32')

dtype('int32')

In [40]:
# 结构化数组类型
student = np.dtype([('name','S20'),  ('age',  np.int8),  ('marks',  'f4')]) 
print(student)

[('name', 'S20'), ('age', 'i1'), ('marks', '<f4')]

In [41]:
# 将结构化数据应用于ndarray对象
a = np.array([('abc',  21,  50),('xyz',  18,  75)], dtype = student)
print(a)

[(b'abc', 21, 50.) (b'xyz', 18, 75.)]

In [42]:
# 通过文件名称访问 name,age,marks 列的内容
print(a['name'])

[b'abc' b'xyz']

In [43]:
print(a['marks'])

[50. 75.]

In [44]:
obj2 = pd.Series({"姓名":"张三","年龄":"12"})
obj2

姓名    张三
年龄    12
dtype: object

In [45]:
obj2["姓名"]

'张三'

In [46]:
obj2[["姓名","年龄"]]

姓名    张三
年龄    12
dtype: object

In [47]:
obj3 = pd.Series(["夏雨荷","山东",19],index=["姓名","地址","年龄"])
obj3
d = pd.Series(["1.0",2,3])
obj3 = pd.Series(d)
obj3

# 关于dtype: object，
# dtype对象来自NumPy，它描述了ndarray中元素的类型。
# 数组中的每个元素必须具有相同的字节大小。对于int64和float64，它们是8字节。
# 但是对于字符串，字符串的长度不是固定的。因此，panda没有直接将字符串字节保存在ndarray中，而是使用object ndarray，
# 它保存指向对象的指针，因此这种ndarray的数据类型是object。

0    1.0
1      2
2      3
dtype: object

In [48]:
# pandas结合这Numpy来进行数学运算
number1 = pd.Series([4,8,16,32])
np.log2(number1)  # 对数运算
a = np.log2(number1) 
type(a)  # pandas.core.series.Series
a

0    2.0
1    3.0
2    4.0
3    5.0
dtype: float64

In [49]:
# DataFrame是Python中Pandas库中的一种数据结构，它类似excel，是一种二维表
df1 = pd.DataFrame([["张无忌",24,"男"],["谢逊",54,"男"],["周芷若",16,"女"]])
df1

     0   1  2
0  张无忌  24  男
1   谢逊  54  男
2  周芷若  16  女

In [50]:
# 使用字典进行构造
data = {
    "人物":["张三丰","张无忌","张翠山"],
    "风景":["武当山","桃花岛","冰火岛"]
}
df2 = pd.DataFrame(data)
df2

    人物   风景
0  张三丰  武当山
1  张无忌  桃花岛
2  张翠山  冰火岛

In [51]:
data2=[["张三丰","张无忌","张翠山"],["武当山","桃花岛","冰火岛"]]
df1 = pd.DataFrame(data2, index=list('ab'), columns=list('ABC'))
print(df1)

     A    B    C
a  张三丰  张无忌  张翠山
b  武当山  桃花岛  冰火岛

In [52]:
df2["人物"]

0    张三丰
1    张无忌
2    张翠山
Name: 人物, dtype: object

In [60]:
df2["人物"][1]

'张无忌'

In [53]:
np_data = [["张无忌",24,"男"],["谢逊",54,"男"],["周芷若",16,"女"]]
df3 = pd.DataFrame(np_data)
df3

     0   1  2
0  张无忌  24  男
1   谢逊  54  男
2  周芷若  16  女

In [3]:
# 读取csv文件
pd.read_csv("data.csv")

    a   b   c   d   e   f
0   1   2   3   4   5   6
1  10  11  12  13  14  15

In [23]:
# 将第一行标题作为数据
a = pd.read_csv("data.csv", header=None)
a

    0   1   2   3   4   5
0   a   b   c   d   e   f
1   1   2   3   4   5   6
2  10  11  12  13  14  15

In [22]:
a[2][1]

'3'

In [5]:
pd.read_csv("data.csv", header=None)[0][0]

'a'

In [6]:
# 指定c列作为索引()
f= pd.read_csv("data.csv",index_col=0)
f

     b   c   d   e   f
a
1    2   3   4   5   6
10  11  12  13  14  15

In [18]:
f["b"][10]

11

In [24]:
a = pd.read_csv("data.csv",index_col='c')
type(a)

pandas.core.frame.DataFrame

In [25]:
# 行列数
csv = pd.read_csv("data.csv")
csv.shape

(2, 6)

In [26]:
# 每一列的数据类型
csv.dtypes

a    int64
b    int64
c    int64
d    int64
e    int64
f    int64
dtype: object

In [27]:
# 显示b列的数据及类型
csv.b

0     2
1    11
Name: b, dtype: int64

In [29]:
# 数据统计性描述
# std 标准差是方差的算术平方根。标准差能反映一个数据集的离散程度。
csv.describe()

               a          b          c          d          e          f
count   2.000000   2.000000   2.000000   2.000000   2.000000   2.000000
mean    5.500000   6.500000   7.500000   8.500000   9.500000  10.500000
std     6.363961   6.363961   6.363961   6.363961   6.363961   6.363961
min     1.000000   2.000000   3.000000   4.000000   5.000000   6.000000
25%     3.250000   4.250000   5.250000   6.250000   7.250000   8.250000
50%     5.500000   6.500000   7.500000   8.500000   9.500000  10.500000
75%     7.750000   8.750000   9.750000  10.750000  11.750000  12.750000
max    10.000000  11.000000  12.000000  13.000000  14.000000  15.000000

In [31]:
# 生成一个固定频率的时间索引
dates = pd.date_range("20201127",periods=6)
dates

DatetimeIndex(['2020-11-27', '2020-11-28', '2020-11-29', '2020-11-30',
               '2020-12-01', '2020-12-02'],
              dtype='datetime64[ns]', freq='D')

In [32]:
# 随机生成6行4列的随机数，索引号显示dates的日期，列名显示ABCD
df = pd.DataFrame(np.random.rand(6,4),index=dates,columns=list("ABCD"))
df

                   A         B         C         D
2020-11-27  0.954386  0.351974  0.977313  0.427173
2020-11-28  0.170961  0.278755  0.939608  0.465598
2020-11-29  0.026289  0.772668  0.043860  0.980952
2020-11-30  0.823238  0.923542  0.473563  0.596641
2020-12-01  0.428754  0.579386  0.346833  0.201212
2020-12-02  0.486256  0.292956  0.128009  0.617873

In [33]:
# 转置，行列切换（与93对比一下）
df.T

   2020-11-27  2020-11-28  2020-11-29  2020-11-30  2020-12-01  2020-12-02
A    0.954386    0.170961    0.026289    0.823238    0.428754    0.486256
B    0.351974    0.278755    0.772668    0.923542    0.579386    0.292956
C    0.977313    0.939608    0.043860    0.473563    0.346833    0.128009
D    0.427173    0.465598    0.980952    0.596641    0.201212    0.617873

In [34]:
# 显示区间里的记录
df["2020-11-27":"2020-11-29"]

                   A         B         C         D
2020-11-27  0.954386  0.351974  0.977313  0.427173
2020-11-28  0.170961  0.278755  0.939608  0.465598
2020-11-29  0.026289  0.772668  0.043860  0.980952

In [35]:
# loc 通过行索引 “Index” 中的具体值来取行数据

df.loc["2020-11-27":"2020-11-29",["A","B"]]

                   A         B
2020-11-27  0.954386  0.351974
2020-11-28  0.170961  0.278755
2020-11-29  0.026289  0.772668

In [36]:
df.loc["2020-11-29",["D"]]

D    0.980952
Name: 2020-11-29 00:00:00, dtype: float64

In [37]:
# 获取A列的值
df.loc[:,["A"]]

                   A
2020-11-27  0.954386
2020-11-28  0.170961
2020-11-29  0.026289
2020-11-30  0.823238
2020-12-01  0.428754
2020-12-02  0.486256

In [38]:
df.loc["2020-11-27"]

A    0.954386
B    0.351974
C    0.977313
D    0.427173
Name: 2020-11-27 00:00:00, dtype: float64

In [40]:
# iloc 通过行号来取行数据
df.iloc[0]

A    0.954386
B    0.351974
C    0.977313
D    0.427173
Name: 2020-11-27 00:00:00, dtype: float64

In [41]:
dates

DatetimeIndex(['2020-11-27', '2020-11-28', '2020-11-29', '2020-11-30',
               '2020-12-01', '2020-12-02'],
              dtype='datetime64[ns]', freq='D')

In [43]:
# at 获取某个位置的值 [索引号，列名]
df.at[dates[0],"A"]

0.9543856287601737

In [44]:
df.at[dates[1],"B"]

0.27875478691189615

In [45]:
# 显示头部N条记录
df.head(2)

                   A         B         C         D
2020-11-27  0.954386  0.351974  0.977313  0.427173
2020-11-28  0.170961  0.278755  0.939608  0.465598

In [46]:
# 显示尾部N条记录
df.tail(3)

                   A         B         C         D
2020-11-30  0.823238  0.923542  0.473563  0.596641
2020-12-01  0.428754  0.579386  0.346833  0.201212
2020-12-02  0.486256  0.292956  0.128009  0.617873

In [47]:
# pandas 重新索引
obj = pd.Series([4.5,9.4,-2.3],index=["a","b","c"])
obj

a    4.5
b    9.4
c   -2.3
dtype: float64

In [48]:
# NaN表示空，表示某个索引不存在，缺省值NaN
obj_1 = obj.reindex(["a","b","c","d","e"])
obj_1

a    4.5
b    9.4
c   -2.3
d    NaN
e    NaN
dtype: float64

In [49]:
# 对缺省值设置默认值，如0
obj_1 = obj.reindex(["a","b","c","d","e"], fill_value=0)
obj_1

a    4.5
b    9.4
c   -2.3
d    0.0
e    0.0
dtype: float64

In [105]:
# 旅游网站数据清洗实战
# df = pd.read_csv("tr.csv",index_col=0)   # 去掉索引
df = pd.read_csv("tr.csv")   # 去掉索引
df.head()

   出发地   目的地     价格     节省             路线名
0    上海   纽约  47000   500.0      大连-烟台3天2晚
1    北京   天津    300  7000.0     北京-秦皇岛2天2夜
2    沈阳  NaN   1200     NaN      沈阳-青岛3天3晚
3  乌鲁木齐   拉萨    500  1200.0    乌鲁木齐-拉萨2天1晚
4   NaN   四川   1200   200.0  江苏-四川4天3夜4天3夜

In [106]:
df.shape

(8, 5)

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   出发地     7 non-null      object
 1   目的地     7 non-null      object
 2    价格     8 non-null      int64
 3   节省      6 non-null      float64
 4   路线名     8 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 448.0+ bytes

In [108]:
df.describe()

                 价格          节省
count      8.000000     6.000000
mean   14360.375000  1650.000000
std    20451.515934  2641.779703
min      300.000000   200.000000
25%     1025.000000   500.000000
50%     4941.500000   500.000000
75%    18500.000000  1025.000000
max    47000.000000  7000.000000

In [109]:
# 把所有的列列出来
# 注意部分列名前后有多余的空格
df.columns

Index(['出发地 ', '目的地', ' 价格', '节省 ', '路线名'], dtype='object')

In [110]:
df.columns.values

array(['出发地 ', '目的地', ' 价格', '节省 ', '路线名'], dtype=object)

In [111]:
col = df.columns.values
col[0].strip()

'出发地'

In [112]:
# 批量清除列名前后空格
df.columns = [x.strip() for x in col]
df.columns.values

array(['出发地', '目的地', '价格', '节省', '路线名'], dtype=object)

In [113]:
# 统计重复值，true表示重复
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [114]:
# 统计重复值的数量
df.duplicated().sum()

1

In [115]:
# 显示重复的记录
df[df.duplicated()]

  出发地 目的地     价格     节省        路线名
6  上海  纽约  47000  500.0  大连-烟台3天2晚

In [116]:
# 删除重复数据（上次记录数量 Length: 23088, dtype: bool） - 重复28条， 应该是 23060
# df.drop_duplicates()  # 显示重复待删除的记录
df.drop_duplicates(inplace=True)  # 执行删除操作（不显示记录）

In [117]:
df.duplicated().sum()

0

In [118]:
df.shape

(7, 5)

In [119]:
# 删除重复记录后，index则变成不连续
df.index

Int64Index([0, 1, 2, 3, 4, 5, 7], dtype='int64')

In [120]:
# 重新让index连续
df.index=range(df.shape[0])

In [121]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [122]:
# 处理异常值
# 旅游网站数据清洗实战
# df = pd.read_csv("tr.csv",index_col=0)   # 去掉索引
df

    出发地  目的地     价格      节省              路线名
0    上海   纽约  47000   500.0        大连-烟台3天2晚
1    北京   天津    300  7000.0       北京-秦皇岛2天2夜
2    沈阳  NaN   1200     NaN        沈阳-青岛3天3晚
3  乌鲁木齐   拉萨    500  1200.0      乌鲁木齐-拉萨2天1晚
4   NaN   四川   1200   200.0    江苏-四川4天3夜4天3夜
5    南京   广州   9000     NaN  南京-广州6天5夜\t6天5夜
6    杭州   西安   8683   500.0    杭州-西安4天4夜4天4夜

In [125]:
df.describe().T

    count         mean           std    min    25%     50%     75%      max
价格    7.0  9697.571429  16883.494147  300.0  850.0  1200.0  8841.5  47000.0
节省    5.0  1880.000000   2885.654172  200.0  500.0   500.0  1200.0   7000.0

In [126]:
# 标准差（standard deviation, STD）表示的就是样本数据的离散程度。
# 标准差越小，表明数据越聚集；标准差越大，表明数据越离散。标准差的大小因测验而定，如果一个测验是学术测验，标准差大，表示学生分数的离散程度大，更能够测量出学生的学业水平；如果一个侧样测量的是某种心理品质，标准差小，表明所编写的题目是同质的，这时候的标准差小的更好。
df["价格"].std()

16883.49414721513

In [127]:
# mean 平均值
df["价格"].sum()/df["价格"].count()  # 等于 df["价格"].mean()

9697.57142857143

In [130]:
df["价格"]-df["价格"].mean()

0    37302.428571
1    -9397.571429
2    -8497.571429
3    -9197.571429
4    -8497.571429
5     -697.571429
6    -1014.571429
Name: 价格, dtype: float64

In [ ]:
# std如何计算？ 每个值减去数量平均值的平方即方差，对平均方差做根号计算的值。
# 参考：https://zhidao.baidu.com/question/537440846.html

In [131]:
# 数据减去平均数除以标准差的值称为“标准分数（standard score）”
sta = (df["价格"]-df["价格"].mean())/df["价格"].std()
sta

0    2.209402
1   -0.556613
2   -0.503306
3   -0.544767
4   -0.503306
5   -0.041317
6   -0.060093
Name: 价格, dtype: float64

In [132]:
# 数据清洗规则，对价格翻一翻的记录做清洗。
# df[sta.abs()]
df[sta.abs()>2]

  出发地 目的地     价格     节省        路线名
0  上海  纽约  47000  500.0  大连-烟台3天2晚

In [133]:
# 还有一种情况是节省>价格也是不正常的，需要清洗
df[df.节省>df.价格]

    出发地 目的地   价格      节省          路线名
1    北京  天津  300  7000.0   北京-秦皇岛2天2夜
3  乌鲁木齐  拉萨  500  1200.0  乌鲁木齐-拉萨2天1晚

In [134]:
# 将两种异常数据进行拼接一下，便于一起处理
pd.concat([df[sta.abs()>2],df[df.节省>df.价格]])

    出发地 目的地     价格      节省          路线名
0    上海  纽约  47000   500.0    大连-烟台3天2晚
1    北京  天津    300  7000.0   北京-秦皇岛2天2夜
3  乌鲁木齐  拉萨    500  1200.0  乌鲁木齐-拉萨2天1晚

In [135]:
# 获取记录的索引号
del_index = pd.concat([df[sta.abs()>2],df[df.节省>df.价格]]).index
del_index

Int64Index([0, 1, 3], dtype='int64')

In [136]:
df

    出发地  目的地     价格      节省              路线名
0    上海   纽约  47000   500.0        大连-烟台3天2晚
1    北京   天津    300  7000.0       北京-秦皇岛2天2夜
2    沈阳  NaN   1200     NaN        沈阳-青岛3天3晚
3  乌鲁木齐   拉萨    500  1200.0      乌鲁木齐-拉萨2天1晚
4   NaN   四川   1200   200.0    江苏-四川4天3夜4天3夜
5    南京   广州   9000     NaN  南京-广州6天5夜\t6天5夜
6    杭州   西安   8683   500.0    杭州-西安4天4夜4天4夜

In [137]:
# 删除记录
# 删除表中的某一行或者某一列更明智的方法是使用drop，它不改变原有的df中的数据，而是可选择性的返回另一个dataframe来存放删除后的数据。
# df.drop(del_index)  # 显示删除后记录（未删除）
df.drop(del_index, inplace=True)  # 执行删除

In [138]:
df

   出发地  目的地    价格     节省              路线名
2   沈阳  NaN  1200    NaN        沈阳-青岛3天3晚
4  NaN   四川  1200  200.0    江苏-四川4天3夜4天3夜
5   南京   广州  9000    NaN  南京-广州6天5夜\t6天5夜
6   杭州   西安  8683  500.0    杭州-西安4天4夜4天4夜

In [139]:
df.shape

(4, 5)

# 查看缺失值
-df.isnull() 查看缺失值
-df.notnull() 查看不为空
-df.dropnd() Fillna填充缺失数据
-df.fillna()

In [140]:
df.isnull()

     出发地    目的地     价格     节省    路线名
2  False   True  False   True  False
4   True  False  False  False  False
5  False  False  False   True  False
6  False  False  False  False  False

In [141]:
df.isnull().sum()

出发地    1
目的地    1
价格     0
节省     2
路线名    0
dtype: int64

In [142]:
df.notnull()

     出发地    目的地    价格     节省   路线名
2   True  False  True  False  True
4  False   True  True   True  True
5   True   True  True  False  True
6   True   True  True   True  True

In [143]:
df.notnull().sum()

出发地    3
目的地    3
价格     4
节省     2
路线名    4
dtype: int64

In [144]:
df[df.节省.isnull()]

  出发地  目的地    价格  节省              路线名
2  沈阳  NaN  1200 NaN        沈阳-青岛3天3晚
5  南京   广州  9000 NaN  南京-广州6天5夜\t6天5夜

In [149]:
# 修改缺失值
df = pd.read_csv("tr.csv")  
df

    出发地  目的地     价格      节省              路线名
0    上海   纽约  47000   500.0        大连-烟台3天2晚
1    北京   天津    300  7000.0       北京-秦皇岛2天2夜
2    沈阳  NaN   1200     NaN        沈阳-青岛3天3晚
3  乌鲁木齐   拉萨    500  1200.0      乌鲁木齐-拉萨2天1晚
4   NaN   四川   1200   200.0    江苏-四川4天3夜4天3夜
5    南京   广州   9000     NaN  南京-广州6天5夜\t6天5夜
6    上海   纽约  47000   500.0        大连-烟台3天2晚
7    杭州   西安   8683   500.0    杭州-西安4天4夜4天4夜

In [150]:
df[df.出发地.isnull()]

   出发地 目的地    价格     节省            路线名
4  NaN  四川  1200  200.0  江苏-四川4天3夜4天3夜

In [151]:
df.loc[df.出发地.isnull(),"路线名"]

4    江苏-四川4天3夜4天3夜
Name: 路线名, dtype: object

In [152]:
[str(x).split("-")[0] for x in df.loc[df.出发地.isnull(),"路线名"]]

['江苏']

In [153]:
df.loc[df.出发地.isnull(),"出发地"] = [str(x).split("-")[0] for x in df.loc[df.出发地.isnull(),"路线名"]]

In [154]:
df

    出发地  目的地     价格      节省              路线名
0    上海   纽约  47000   500.0        大连-烟台3天2晚
1    北京   天津    300  7000.0       北京-秦皇岛2天2夜
2    沈阳  NaN   1200     NaN        沈阳-青岛3天3晚
3  乌鲁木齐   拉萨    500  1200.0      乌鲁木齐-拉萨2天1晚
4    江苏   四川   1200   200.0    江苏-四川4天3夜4天3夜
5    南京   广州   9000     NaN  南京-广州6天5夜\t6天5夜
6    上海   纽约  47000   500.0        大连-烟台3天2晚
7    杭州   西安   8683   500.0    杭州-西安4天4夜4天4夜

In [155]:
# 练习题: 如何修改目的地？ 
str(df.loc[df.目的地.isnull(),"路线名"].values)

"['沈阳-青岛3天3晚']"

In [156]:
# 通过正则表达式获取目的地？
import re
re.findall("-(.*)\d天","['沈阳-青岛3天3晚']") 
# x[0]
# re.findall("(.*)\d",x[0])[0]

['青岛']

In [159]:
str(df.loc[df.目的地.isnull(),"路线名"].values).split("-")[1]

"青岛3天3晚']"

In [163]:
import sys
sys.path.append("../")
from PO.StrPO import *
Str_PO = StrPO()
tmp = Str_PO.indexNumber(str(df.loc[df.目的地.isnull(),"路线名"].values).split("-")[1])
tmp

# 第一个3在第三个位置,第二个3在第五个位置 [['3', 2], ['3', 4]]

[['3', 2], ['3', 4]]

In [164]:
tmp[0][1]

2

In [166]:
[str(x).split("-")[1] for x in df.loc[df.目的地.isnull(),"路线名"]][0][:tmp[0][1]]

'青岛'

In [167]:
df.loc[df.目的地.isnull(),"目的地"] = [str(x).split("-")[1] for x in df.loc[df.目的地.isnull(),"路线名"]][0][:tmp[0][1]]

In [168]:
df[df.目的地.isnull()]

Empty DataFrame
Columns: [出发地, 目的地, 价格, 节省, 路线名]
Index: []

In [169]:
df

    出发地 目的地     价格      节省              路线名
0    上海  纽约  47000   500.0        大连-烟台3天2晚
1    北京  天津    300  7000.0       北京-秦皇岛2天2夜
2    沈阳  青岛   1200     NaN        沈阳-青岛3天3晚
3  乌鲁木齐  拉萨    500  1200.0      乌鲁木齐-拉萨2天1晚
4    江苏  四川   1200   200.0    江苏-四川4天3夜4天3夜
5    南京  广州   9000     NaN  南京-广州6天5夜\t6天5夜
6    上海  纽约  47000   500.0        大连-烟台3天2晚
7    杭州  西安   8683   500.0    杭州-西安4天4夜4天4夜

In [170]:
df.describe().T

    count       mean           std    min     25%     50%      75%      max
价格    8.0  14360.375  20451.515934  300.0  1025.0  4941.5  18500.0  47000.0
节省    6.0   1650.000   2641.779703  200.0   500.0   500.0   1025.0   7000.0

In [172]:
round(df['节省'].mean(),0)

1650.0

In [173]:
# 将平均价格填充价格缺失值
df['节省'].fillna(round(df['节省'].mean(),0),inplace=True)

In [174]:
df

    出发地 目的地     价格      节省              路线名
0    上海  纽约  47000   500.0        大连-烟台3天2晚
1    北京  天津    300  7000.0       北京-秦皇岛2天2夜
2    沈阳  青岛   1200  1650.0        沈阳-青岛3天3晚
3  乌鲁木齐  拉萨    500  1200.0      乌鲁木齐-拉萨2天1晚
4    江苏  四川   1200   200.0    江苏-四川4天3夜4天3夜
5    南京  广州   9000  1650.0  南京-广州6天5夜\t6天5夜
6    上海  纽约  47000   500.0        大连-烟台3天2晚
7    杭州  西安   8683   500.0    杭州-西安4天4夜4天4夜

In [175]:
df["几天几夜"] = df.路线名.str.extract("(\d天\d夜)",expand=False)

In [176]:
df["几天几夜"]

0     NaN
1    2天2夜
2     NaN
3     NaN
4    4天3夜
5    6天5夜
6     NaN
7    4天4夜
Name: 几天几夜, dtype: object

In [177]:
df

    出发地 目的地     价格      节省              路线名  几天几夜
0    上海  纽约  47000   500.0        大连-烟台3天2晚   NaN
1    北京  天津    300  7000.0       北京-秦皇岛2天2夜  2天2夜
2    沈阳  青岛   1200  1650.0        沈阳-青岛3天3晚   NaN
3  乌鲁木齐  拉萨    500  1200.0      乌鲁木齐-拉萨2天1晚   NaN
4    江苏  四川   1200   200.0    江苏-四川4天3夜4天3夜  4天3夜
5    南京  广州   9000  1650.0  南京-广州6天5夜\t6天5夜  6天5夜
6    上海  纽约  47000   500.0        大连-烟台3天2晚   NaN
7    杭州  西安   8683   500.0    杭州-西安4天4夜4天4夜  4天4夜

In [178]:
# df.to_csv("tr2.csv")

In [179]:
import pandas as pd
from sqlalchemy import create_engine

In [184]:
# 使用pymysql模块初始化数据库连接
engine = create_engine('mysql+pymysql://ceshi:123456@192.168.0.233:3336/TD_OA')

In [185]:
#  with engine.connect() as con:
#      con.execute('DROP TABLE if exists user_jh')

In [181]:
# 读表
sql_cmd = "select * from user_jh where user_name='金浩'"
df = pd.read_sql(sql=sql_cmd, con=engine)

In [182]:
print(df.head())

   UID USER_ID USER_NAME USER_NAME_INDEX  BYNAME USEING_KEY USING_FINGER  \
0  148     148        金浩           j*gh*  jinhao          0            0

                             PASSWORD KEY_SN SECURE_KEY_SN  ...  \
0  $1$Ka..PE5.$trdicewbzMjCahhVwxP6A/                       ...

   USER_MANAGE_ORGS  DEVICE_NUMBER MOBIL_NO_BD corp_id ATTENDANCE_ID  VX_MARK  \
0                                                                 35

  IMEI  MODEL PLATFORM                       UNIONID
0                       oKsp-t_nINmdEWKbX1YAoCXJffBA

[1 rows x 83 columns]

In [183]:
print(df["USER_NAME"][0])

金浩